TOKEN = '8066409673:AAHdt9JMjD_CG-8bt2ID9sxT3Y12mf07FJo'
ID_CHANNEL_MARKET = '-1002745631867'
ID_CHANNEL_NEWS = '-1002712559152'
ID_CHAT_REPORTS = '-4866097163'

ADMINS = [696906752]

ID_ITEM_FOR_SELL = [13, 14, 15, 22, 23, 24, 25, 26, 27, 28, 29]

SEEDS = {
    'wheat': 1,
    'carrot': 2,
    'corn': 3,
    'potato': 4,
    'moon_lotus': 5,
    'fire_pepper': 6,
    'random': 30
}

TIME_SEEDS = {
    1: ['10 минут', 10],
    2: ['20 минут', 20],
    3: ['30 минут', 30],
    4: ['45 минут', 45],
    5: ['6 часа', 360],
    6: ['4 часа', 240],
    30: ['5 часов', 300]
}

HARVEST = {
    1:16,
    2:17,
    3:18,
    4:19,
    5:20,
    6:21
}

PRICE_UPGRADE_DISEASE_RESISTANCE = { # Деньги|лечебная трава
    10: [7000, 3],
    9: [9800, 4],
    8: [13720, 4],
    7: [19208, 4],
    6: [26891, 5],
    5: [37648, 5],
    4: [52707, 6],
    3: [73789, 6],
    2: [103305, 7],
    1: [144627, 8]
}

PRICE_UPGRADE_TIME_WATERING = {
    8: [6500, 3],
    9: [8450, 4],
    10: [10985, 4],
    11: [14280, 4],
    12: [18565, 5],
    13: [24134, 5],
    14: [31374, 6],
    15: [40787, 6],
    16: [53022, 7],
    17: [68929, 8],
    18: [89608, 9],
    19: [116490, 9],
    20: [151438, 10],
    21: [196869, 11],
    22: [255929, 13],
    23: [332708, 14]
}

PRICE_BUY_BEDS = {
    1: 75000,
    2: 112500,
    3: 168750,
    4: 253125,
    5: 379688,
    6: 569531,
    7: 854297,
    8: 1281445,
    9: 1922168
}

TYPE_BOX = {
    23: {
            'Монеты': (50, 100, 60, 0),      # (мин, макс, шанс в %, id)
            'Пшеница': (2, 5, 20, 16),
            'Морковь': (2, 5, 10, 17),
            'Кукуруза': (2, 5, 5, 18),
            'Картофель': (2, 5, 5, 19)
    },
    24: {
            'Монеты': (100, 200, 50, 0),
            'Кукуруза': (5, 10, 20, 17),
            'Картофель': (5, 10, 20, 19),
            'Лунный лотос': (1, 2, 5, 20),
            'Огненный перец': (1, 2, 5, 21)
    },
    25: {
            'Монеты': (300, 500, 40, 0),
            'Лечебная трава': (1, 2, 15, 22),
            'Молекула дождя': (1, 2, 15, 13),
            'Сновиденческая трава': (1, 2, 15, 14),
            'Квантовый обломок': (1, 2, 15, 15)
    },
    26: {
            'Монеты': (1000, 1500, 35, 0),
            'Бустер "Отказ от воды"': (1, 1, 10, 27),
            'Бустер "Удвоенный урожай"': (1, 1, 10, 28),
            'Бустер "Отсутствие болезней"': (1, 1, 10, 29),
            'Золотая монета': (1, 10, 35, -1)
    }
}

EVENTS = {
    1: 'Случайное семечко',
    2: 'Фермерская гонка',
    3: 'Общая цель'
}